{"data":{"markdownRemark":{"html":"<h1>将生活比喻成方程 我们能得到那些 能够借助这一隐喻推断出那些?</h1>\n<p>每个人看待生活的隐喻不同,在我看来问题所要表达的应该是,如果我们把生活比作方程式,那么这个方程式是否存在解,如果存在解的话其中是否有一个最优解.</p>\n<h1>什么是方程 什么是最优解</h1>\n<blockquote>\n<p>如果把数学当作语言，那么方程可以为人们提供一些用来描述他们所感兴趣的对象的语法，它可以把未知的元素包含到陈述句当中（比如用“相等”这个词来构成的陈述句），因此如果人们对某些未知的元素感兴趣，但是用数学语言去精确地表达那些确定未知元素的条件时需要用到未知元素本身，这时人们就常常用方程来描述那些条件，并且形成这样一个问题：能使这些条件满足的元素是什么？在某个集合内，能使方程中所描述的条件被满足的元素称为方程在这个集合中的解（比如代入某个数到含未知数的等式，使等式中等号左右两边相等）。\n-- <cite><a href=\"https://zh.wikipedia.org/wiki/%E6%96%B9%E7%A8%8B\">维基百科-方程</a></cite></p>\n</blockquote>\n<blockquote>\n<p>通常定义为不牺牲任何总目标和各分目标的条件下，技术上能够达到的最好的解。它表示所有的总目标和分目标都可以达到的理想的解。而实际上这样的解是很少存在的。工程问题固有的内在因素总是包含各种矛盾的，由于科学水平的限制，很多设计因素和系统的约束还不是很了解;许多判别准则。例如： 社会上的相互关系、生活的质量、生态学，以及兴趣、爱好等等，是不容易确定的，更不容易定量化。而工程系统的设计问题或规划问题中劳动力、设备、财力以及时间总是有限的。所以，最优化过程只是产生一个在设计和工艺约束条件下所能达到的“最令人满意解”。。\n-- <cite><a href=\"https://zh.wikipedia.org/wiki/%E6%96%B9%E7%A8%8B\">百度百科-最优解</a></cite></p>\n</blockquote>\n<p>现在我们来套用隐喻</p>\n<h1>生活作为名词 即一个方程组</h1>\n<p>生活中可以很轻松的找到元素和元素关系之间的对应隐喻,举个例子就是 </p>\n<ul>\n<li>肤白貌美约等于(或大概率上)有人追 </li>\n<li>很多人追得到幸福的机率大于很少或者没人追  </li>\n</ul>\n<p>当然上面两个方程描述很有可能有问题 只是举个例子 这样的方程我们可以一一列举出来并联立 就组成了生活这个方程组.</p>\n<h2>1. 这个方程组一直在变化 受个人条件的限制每个人的方程组还不一样</h2>\n<p>随着物理学心理学等和社会的发展,生活的这个方程组中无时无刻不在加入新的元素,新的方程,更多更底层关系被揭露出来的同时,其他之前毫无联系的元素之间的关系也在被建立 (在之前打游戏和赚钱就没什么关系).\n每个人面对的生活情况不同,很难存在相同的关系式,草根基本上就可以忽略掉如何分配巨额遗产等的问题<br>\n为了解决这个问题 我们将生活这个方程组特化为固定的现在自己已知的能够列出的方程的组合</p>\n<h2>2 最优解是什么?</h2>\n<p>求解一定要有未知元素,那么在生活的这个方程组中未知元素是什么?<br>\n这实际上就涉及到了个人的想法了,每个人都有自己不同的目标. 最优解就是达到这一目标的方法 我们所需要的元素的数值.</p>\n<h3>2.1 有目标</h3>\n<h4>2.1.1 条件不足 无法解答</h4>\n<p>如何你想要赚钱,却不知道怎么做.那自然是绝对无解的了.\n解决办法是学习新的姿势,扩充自己生活的方程,再来求解.</p>\n<h4>2.1.2 条件矛盾 无法解答</h4>\n<p>目标变成大帅哥 变成这种描述就代表着条件的矛盾 而现实存在的不可逆就必然的导致无解.\n解决办法是重新设置目标 将目标改为如何看起来是大帅哥 认识自己 理解自己 再来求解</p>\n<h4>2.1.3 最优解并不最优</h4>\n<p>如何你想要最快赚大钱 但对于你来讲最优解是割肾卖肉 这种最优解肯定是无法接受的\n解决办法可以参见2.1.1 学习新姿势 用专业技能赚钱 或参见2.1.2 修正目标加上限定条件 健康的最快赚大钱 再来求解</p>\n<h3>2.2 没有目标</h3>\n<p>有目标就代表着有可能组成方程,但没目标怎么办?没有靶子就不用想射中了\n解决方法就是 将目标换成如何找到目标 然后列公式思考</p>\n<ol>\n<li>目标是能够一直追逐的的有意义的东西</li>\n<li>最好追逐目标的过程与满足基本生活所需的过程不冲突</li>\n<li>最好追逐目标的过程很快乐</li>\n</ol>\n<h2>3. 求解之后</h2>\n<p>生活这个方程组并不是找到最优解,即使通过思考找到了最优解 例如赚钱的最优解可能就是 读书了解经济知识+获得第一桶金=>投资=>再投资<br>\n但是生活在我们找到自认为的最优解之后还在继续 如何实践这个最优解?如何克服懒惰,克服欲望?\n实际上这又如何镜子一样映照出镜子自己 解决的办法就是开启一个新的问题 目标替换过去 再来求解</p>\n<h1>未完待(不一定)续</h1>\n<p>虽然写着写着已经变成鸡汤了 但是从生活-方程式的隐喻还是很有趣的 例如</p>\n<ul>\n<li>如果关注点在求解做动词. 如何求得最优解? 带入消元的方法在生活中代表什么? (是不是会全部消解为金钱这一变量?)</li>\n<li>解的范围在生活中代表什么?</li>\n<li>唯一解还是多个解怎么讲?</li>\n<li>如果有更高深的数学基础 是否还能发现更多的对比?</li>\n</ul>\n<p>但我明天还要搬砖,就先鸽为敬了</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/I Want To Talk\\zhihu/生活是否存在最优解/"}}