{"data":{"markdownRemark":{"html":"<p>当我们在讲话的时候，我们到底在讲什么？所谓的我到底又是什么？此时此刻的我这个说话的我到底指的是什么呢？一堆蛋白质。声带的摩擦撕裂。神经元的跳动开关的组合阀值的突破，一堆一堆变量的变化，这些东西只不过是物理世界上的一些变化而已。所谓的我我们认为的不同于石头的东西，不同于计算机的东西，不同于这种虚构起来的建设，在虚假的，必然的巧合之上的一级构造上的灵魂所在，到底是什么呢？实际上是没有的。就好比与非门能够构造出整个计算机世界一样，能够造出if，else能够导出选择一样。好像计算机是有灵魂的，好像计算机是能够选择的，好像生命是有意志的，能够导向最优的计划一样。我是不存在的，人类的灵魂也是不存在的。老胡在后面的几张里面一直在用哥德尔配数的例子来举例数学上面数学上的概念是如何自己映射到自己的。这就好比我们的例子一样。他举哥德尔配数的例子，主要是想表明纯粹的逻辑上的数字几是能够映射到字迹上面的。我们的人类同样也是如此。当感受器感受到自己的时候，这样就能够达到闭环，就能够达到递归，就能够达到老胡所说的b圈怪圈。所谓的灵魂，所谓的自我，这怪圈的循环中所诞生的一种概括，一种表象，一种隐喻。是一种行为方式的概括。我的怪圈指的便是人类的应在意识到我这个概念的同时。我感觉老侯在后面几章里面有点怎么样呢，为他对妻子的思念作出的假设。虽然我比较我是比较认同这种假设的，正如我比较认同音遇的假设。老吴说他人是可以活在自己脑海中的，这让我实际上就想到了青柠们。清明梦实际上就是这种东西的体现。或者讲幻想，通过自己与自己的交谈，将自我的怪圈分裂出一个他人的怪圈，并与这个怪圈不断的交流灌溉时期，卓越的发展起来，从而形成的就是在自我这个肉体的循环中构造出了一个他人的循环，这个所谓的循环便是不同于自己的自我的这个概念，而是另一个人，所谓的另一个人，实际上也不过是依托于这个肉体存在的过程中的一个怪圈而已。就如同计算机一样，在图灵机的架构之下，不论是什么样的操作系统都可以运转得起来。 同样在神经网络的运转之下，什么样的自我都可以达到孕育出来。我现在这个在说话的我，不过是我大脑中的神经元的一种反映，一种体现一种思索，我是不存在的，我是有超我自我这种区别的，所谓的这种区别便是在于。对于自我的不同认知导致的不同的自我的怪声的循环而已，理智上的我与爬行动物的我，其目标与本质是不同的。马斯洛的这个自我需求认知金字塔，实际上就体现的是这种区别。我们可以假设爬行动物的，我实际上追求的是比较下一层面的自我的自我追求。而构建在爬行动物上我的你记得我不能超，我追求的就是比较上一次的层次的自我追求。再举一个例子，当喝醉后的我是哪一种我呢？我认为喝醉后的我实际上是比较接近超我的状态的爬行动物的，我实际上在喝醉的过程中会被酒精屏蔽掉一些限制器。这种限制器实际上就是会让一个人体现出真我。我在之前看到过一些小说或是说一些文章，他们所想表达的意思便是我并不是一个独立的个体。而是一堆我的一种鸡和一种表现。想吃机上的爬行动物脑的我，他所想追求的便是性饥饿，温饱这种概念趋光性，捕食性存活基因的选择这种概念。在此之上的你知道我所追求的就是自我追求，自我认同，自尊，骄傲，自我实现这种概念。我的怪圈被在于自己认识到自己，自己对自己作出反馈。在这个循环中，我们所表达出的行为便是我。也实际上就是假，然后并不认为世界上有灵魂这种东西的存在，它只不过是在讲当物质基础达到一定的复杂程度之后，实际上就是吴静华那本书讲的一样达到了这种。对信息的表达实际上也就是基因，也就是信息的选择，也就是信息化的之后。复杂程度导致了对整个系统认知到了其自我的存在，读一本书。最重要的。没想到我们改变世界到底有多少？老猴子这本书给我的感觉就是。我是可以被训练的。我不是一个新鲜的东西，只不过是一个硬件上的一个循环而已，我的理智是一个我我的自我是一个我我可以改变我，这就是我对老侯这本书的最重要的理解。循环可以被变量改变，这就是为什么天天向上去这么重要的原因。</p>","fields":{"slug":"/baseball/我的怪圈/","disqus":{"shortname":"woodgear-blog"}},"frontmatter":{"id":"0199e2b","time":"2019-01-29T22:10:07+08:00","tag":null},"parent":{"__typename":"File","name":"我的怪圈","ext":".md","birthTime":"1970-01-01T00:00:00.000Z","changeTime":"2020-09-26T05:06:48.450Z","relativeDirectory":"baseball","absolutePath":"/home/oaa/ns/share/blog/baseball/我的怪圈.md"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/baseball/我的怪圈/","disqus":{"shortname":"woodgear-blog"}}}